Revit 2027 API
BuiltInFailures.TrussFailures.TrussNotJoinedWebs Property
 The current edits are causing some webs to disjoin. The truss layout family requires additional constraints to maintain these joins.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussNotJoinedWebs { get; }
Public Shared ReadOnly Property TrussNotJoinedWebs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussNotJoinedWebs {
	FailureDefinitionId^ get ();
}
static member TrussNotJoinedWebs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace